mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
	case UPLINK_CMD_SET_GONOGO:
		/* Doesn't move hardware, just changes what's allowed to gate a
		 * later ARM. */
		missionControl.go_no_go_enabled = (uint8_t)(arg & 0xFFu);
		printf("GONOGO enabled=0x%02X\r\n", missionControl.go_no_go_enabled);
		return;

	default:
		return;
	}
}


#define FRACTIONAL(x) int(floor(int((x)*100)))%100
#define LOG_TERMINATOR  0x0A0Du   /* LF,CR packed MSB-first */

//#define PI 3.1415926536f

// TODO: PS sensor 3 encodere yakin olan
// TODO: PS sensor 0 alttaki
void LED_Counter_Tick(void);


// TODO: islemci acilma sirasinda akim sensorlerini sifirlayacak.


volatile uint64_t micros_overflow=0;
float load;
//uint32_t local_sensor_data_dropped=0;



void current_adc_complete();
void encoder_adc_complete();
void pressure_adc_complete();

task_timer_t test_point_gpio = {5000,0};
task_timer_t button_task = {1,0};
task_timer_t IMU_task = {1,0};
task_timer_t sd_card_task = {500,0};
task_timer_t printf_task = {1, 0};
task_timer_t heartbeat_task = {100, 0}; // period ms, start ms

task_timer_t uart_logging = { 2, 0};
task_timer_t nrf24_tx_task = {20, 0};   // 50 Hz downlink

__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_current[5];
__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_encoder[8*4];
__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_pressure[6];

uint32_t timeOfLastPrint=uwTick;


DebouncedButton Button{1,BUTTON_USER_GPIO_PORT,BUTTON_USER_PIN};
DebouncedButton SafetyConnector{1,SAFETY_CONNECTOR_GPIO_Port,SAFETY_CONNECTOR_Pin};
volatile float load_filtered;
uint16_t crc16_calc(const uint8_t *p, size_t n);
bool mount_ok;
bool file_creation_ok;
float time_sec = 0;
int load_cell_counter = 0;

SensorData_t local_sensor_data{'K','D'};

void onImuReport(const BNO085& r);
void onLidarFrame(uint16_t distMm, uint16_t strength);

LowPass load_lpf{1.0f, 1000,1};  // 30 Hz cutoff @ 1 kHz sample rate
LowPass accel_interval{1.0f, 1000,1};  // 30 Hz cutoff @ 1 kHz sample rate
LowPass quatIntRV_interval{1.0f,1000,1};

Profiler free_profiler{"free"};
Profiler load_cell_profiler{"load"};
Profiler main_loop_profiler{"main"};
Profiler printf_profiler{"prin"};
Profiler adc1_profiler{"enco"};
Profiler adc2_profiler{"curr"};
Profiler adc3_profiler{"pres"};
Profiler tim2_profiler{"tim2"};
Profiler tim3_profiler{"tim3"};
Profiler tim4_profiler{"tim4"};
Profiler button_profiler{"butt"};
Profiler crc_profiler{"crc_"};
Profiler IMU_profiler{"IMU_"};
Profiler nrf24_profiler{"nrf2"};
Profiler sd_card_profiler{"sd_c"};
Profiler tim7_profiler{"tim7"};
Profiler kf_profiler{"kf_p"};
Profiler tim12_profiler{"tim1"};

Profiler *profilers[] = {
		&free_profiler,
		&load_cell_profiler,
		&main_loop_profiler,
		&printf_profiler,
		&adc1_profiler,
		&adc2_profiler,
		&adc3_profiler,
		&tim2_profiler,
		&tim3_profiler,
		&tim4_profiler,
		&button_profiler,
		&crc_profiler,
		&IMU_profiler,
		&nrf24_profiler,
		&sd_card_profiler,
		&tim7_profiler,
		&kf_profiler,
		&tim12_profiler,

};


float battery_voltage = 0;
//bool True = true;
//MissionControl missionControl(&True,
//			&logData.record);
MissionControl missionControl(&logData.ready, &logData.record);

//platformController platform_controller;



/* Called by MissionControl the moment a mission is triggered, before
 * log_recording goes true. Wire it to your f_expand pre-allocation. */
//static void logPrepareHook(uint32_t estimated_duration_ms, const char *header)
//{
//    const uint32_t bytes_per_s = 1000u * sizeof(SensorData_t);   // ~1 kHz logging
//    const uint32_t bytes = (estimated_duration_ms / 1000u) * bytes_per_s;
////    sd_log_prepare(bytes, header);      // your sd_task API
//
//}
static uint32_t calStartTick = 0;   // set right after beginCalibration()

void app_init() {
	SensorData_Buffer_Init(&logData);

	for (int i = 0; i<4; i++){
		for (int j=0; j<11; j++){
			actuator[i].actuatorController.rtU.ValveFitPressureRatios[j] = ValveFitPressureRatios[i][j];
		}
		actuator[i].actuatorController.rtU.nozzle_gain = nozzle_gain[i];
	}
//	Button.DebouncedButton(1);
	logData.ready=false;
//	logData.record = false;
//	SensorData_Buffer_Init(&logData_axiram);
	HAL_ADCEx_Calibration_Start(&hadc2, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED);
	  HAL_ADC_Start_DMA(&hadc2, (uint32_t*)adc_dma_buf_current, 5);

	  HAL_ADCEx_Calibration_Start(&hadc1, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED);
	  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_dma_buf_encoder, 32);

	  HAL_ADCEx_Calibration_Start(&hadc3, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED);
	  HAL_ADC_Start_DMA(&hadc3, (uint32_t*)adc_dma_buf_pressure, 6);


	//  HAL_TIM_Base_Start(&htim3);
	  __HAL_TIM_SET_COUNTER(&htim2, htim2.Instance->ARR - 6);    // ~15 µs to first fire
	  __HAL_TIM_SET_COUNTER(&htim3, htim3.Instance->ARR - 36);   // ~45 µs
//	  actuator[0].actuatorController

#if CHECK_TIMER_FREQUENCIES
	  HAL_TIM_Base_Start_IT(&htim2);  /* pressure */
	  HAL_TIM_Base_Start_IT(&htim3);  /* current */
	  HAL_TIM_Base_Start_IT(&htim4);  /* encoder  */
#else
	  HAL_TIM_Base_Start(&htim2);  /* pressure */
	  HAL_TIM_Base_Start(&htim3);  /* current */
	  HAL_TIM_Base_Start(&htim4);  /* encoder  */
#endif
	  HAL_TIM_Base_Start_IT(&htim5);  /* _IT = interrupt ile */
	  HAL_TIM_Base_Start_IT(&htim12);  /* _IT = interrupt ile */


	  HAL_TIM_Base_Start(&htim1);  /* _IT = interrupt ile */

	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
      BSP_LED_On(LED_RED);

//	  actuator[0].setDuty(1.0f);
//	  motors[0].setDuty(1.0f);
      p.lever[2]   = 0.06f;
      p.sigmaAccel = 0.30f;
      g_altEst.configure(p);
	  if (!imu.begin(&hspi1)) {
//	          Error_Handler();
	      }
//	  imu.enableReport(SH2_RAW_ACCELEROMETER,  2500);
	  imu.enableReport(SH2_GYRO_INTEGRATED_RV, 2500);   // 400 Hz
	  imu.enableReport(SH2_ACCELEROMETER, 5000);   // 200 Hz

//	  imu.enableReport(SH2_GAME_ROTATION_VECTOR,2500);

	  /* nRF24 telemetry: downlinks local_sensor_data at 50 Hz, see
	   * nrf24_tx_task (app_loop) and nrf24_link_service() (tim7_trigger,
	   * 1 kHz). Auto-ack stays on so ground -> rocket commands can ride
	   * back on the ACK payload; ch/addr/data-rate must match the ground
	   * station config (see conversation history on that sync). */
	  {
	      nrf24_cfg_t nrf24_cfg;
	      nrf24_default_cfg(&nrf24_cfg);
	      nrf24_cfg.data_rate = NRF24_DR_2M;
	      nrf24_status_t nrf24_st = nrf24_init(&nrf24_cfg);
	      printf("nRF24: %s (status=%d)\r\n",
	             (nrf24_st == NRF24_OK) ? "OK, radio present" : "NOT FOUND",
	             (int)nrf24_st);
	      if (nrf24_st == NRF24_OK) {
	          nrf24_link_init(false);   /* auto-ack downlink */
	          nrf24_start_tx();
	      }
		  HAL_TIM_Base_Start_IT(&htim7);  /* micros() timebase -- must be running before imu.begin() so its internal sh2 timeouts can actually elapse */
	  }

		lidar.Reset();
//		altEstimator.begin();
		HAL_UARTEx_ReceiveToIdle_DMA(&huart6, lidar.getBuffer(), 128);
//	  dummy_init();
//	  printf(CLR_SCREEN);

//	    local_sensor_data.current_demand = 2;
//	    local_sensor_data.timestamp = 0;
//	    ready_to_write_a=0;
		for (int i=0; i<(sizeof(profilers)/sizeof(profilers[0])); i++)
			profilers[i]->reset();

	    HAL_Delay(10);
	    for (int i=0; i<4; i++)
	    	actuator[i].calibrate();
	    platform_controller.initialize();

		for (int i= 0; i< 4; i++) {
			actuator[i].actuatorController.rtU.pos_feedback = actuator[i].hallEffect.valveAngle;
			actuator[i].actuatorController.rtU.SpeedFeedback = actuator[i].hallEffect.valveVelocity;
			actuator[i].actuatorController.rtU.P_manifold = Actuator::manifold->getPsi();
			actuator[i].actuatorController.rtU.P_nozzle_demand = 0.0F;

